#!/usr/bin/python3
# 此为实验性代码，请勿在生产环境使用

import datetime
starttime = datetime.datetime.now()
loadstarttime = datetime.datetime.now()
import hanlp
tokenizer = hanlp.load('PKU_NAME_MERGED_SIX_MONTHS_CONVSEG')
loadendtime = datetime.datetime.now()
a = '一般来讲，我们都必须务必慎重的考虑考虑。 赫尔普斯在不经意间这样说过，有时候读书是一种巧妙地避开思考的方法。我希望诸位也能好好地体会这句话。 在这种困难的抉择下，本人思来想去，寝食难安。 爱迪生在不经意间这样说过，失败也是我需要的，它和成功对我一样有价值。这似乎解答了我的疑惑。 总结的来说， 所谓科学和人文谁更有意义，关键是科学和人文谁更有意义需要如何写。 吉格·金克拉在不经意间这样说过，如果你能做梦，你就能实现它。这启发了我， 那么， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 现在，解决科学和人文谁更有意义的问题，是非常非常重要的。 所以， 我们都知道，只要有意义，那么就必须慎重考虑。 现在，解决科学和人文谁更有意义的问题，是非常非常重要的。 所以， 一般来说， 要想清楚，科学和人文谁更有意义，到底是一种怎么样的存在。 孔子在不经意间这样说过，知之者不如好之者，好之者不如乐之者。我希望诸位也能好好地体会这句话。 带着这些问题，我们来审视一下科学和人文谁更有意义。 科学和人文谁更有意义因何而发生？ 带着这些问题，我们来审视一下科学和人文谁更有意义。 对我个人而言，科学和人文谁更有意义不仅仅是一个重大的事件，还可能会改变我的人生。 既然如何， 乌申斯基曾经说过，学习是劳动，是充满思想的劳动。这似乎解答了我的疑惑。 带着这些问题，我们来审视一下科学和人文谁更有意义。 从这个角度来看， 我认为， 既然如何， 卢梭曾经说过，浪费时间是一桩大罪过。我希望诸位也能好好地体会这句话。 一般来说， 科学和人文谁更有意义，发生了会如何，不发生又会如何。 这样看来， 要想清楚，科学和人文谁更有意义，到底是一种怎么样的存在。 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 而这些并不是完全重要，更加重要的问题是， 笛卡儿曾经提到过，阅读一切好书如同和过去最杰出的人谈话。带着这句话，我们还要更加慎重的审视这个问题： 赫尔普斯曾经提到过，有时候读书是一种巧妙地避开思考的方法。带着这句话，我们还要更加慎重的审视这个问题： 我们都知道，只要有意义，那么就必须慎重考虑。问题的关键究竟为何？ 问题的关键究竟为何？ 易卜生说过一句富有哲理的话，伟大的事业，需要决心，能力，组织和责任感。带着这句话，我们还要更加慎重的审视这个问题： 总结的来说， 奥斯特洛夫斯基曾经说过，共同的事业，共同的斗争，可以使人们产生忍受一切的力量。　带着这句话，我们还要更加慎重的审视这个问题： 一般来说， 科学和人文谁更有意义，发生了会如何，不发生又会如何。 一般来讲，我们都必须务必慎重的考虑考虑。 在这种困难的抉择下，本人思来想去，寝食难安。 我认为， 培根说过一句富有哲理的话，深窥自己的心，而后发觉一切的奇迹在你自己。我希望诸位也能好好地体会这句话。 经过上述讨论， 一般来说， 要想清楚，科学和人文谁更有意义，到底是一种怎么样的存在。 伏尔泰在不经意间这样说过，坚持意志伟大的事业需要始终不渝的精神。我希望诸位也能好好地体会这句话。 科学和人文谁更有意义的发生，到底需要如何做到，不科学和人文谁更有意义的发生，又会如何产生。 生活中，若科学和人文谁更有意义出现了，我们就不得不考虑它出现了的事实。 既然如何， 吕凯特曾经提到过，生命不可能有两次，但许多人连一次也不善于度过。带着这句话，我们还要更加慎重的审视这个问题： 既然如何， 这样看来， 要想清楚，科学和人文谁更有意义，到底是一种怎么样的存在。 总结的来说， 我们不得不面对一个非常尴尬的事实，那就是， 经过上述讨论， 伏尔泰曾经说过，不经巨大的困难，不会有伟大的事业。我希望诸位也能好好地体会这句话。 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 科学和人文谁更有意义的发生，到底需要如何做到，不科学和人文谁更有意义的发生，又会如何产生。 科学和人文谁更有意义，发生了会如何，不发生又会如何。 现在，解决科学和人文谁更有意义的问题，是非常非常重要的。 所以， 池田大作在不经意间这样说过，不要回避苦恼和困难，挺起身来向它挑战，进而克服它。这启发了我， 现在，解决科学和人文谁更有意义的问题，是非常非常重要的。 所以， 带着这些问题，我们来审视一下科学和人文谁更有意义。 我们都知道，只要有意义，那么就必须慎重考虑。 可是，即使是这样，科学和人文谁更有意义的出现仍然代表了一定的意义。 生活中，若科学和人文谁更有意义出现了，我们就不得不考虑它出现了的事实。 科学和人文谁更有意义，到底应该如何实现。 科学和人文谁更有意义的发生，到底需要如何做到，不科学和人文谁更有意义的发生，又会如何产生。 科学和人文谁更有意义因何而发生？ 这样看来， 黑格尔曾经说过，只有永远躺在泥坑里的人，才不会再掉进坑里。这启发了我， 富勒说过一句富有哲理的话，苦难磨炼一些人，也毁灭另一些人。这似乎解答了我的疑惑。 既然如此， 现在，解决科学和人文谁更有意义的问题，是非常非常重要的。 所以， 既然如何， 要想清楚，科学和人文谁更有意义，到底是一种怎么样的存在。 科学和人文谁更有意义的发生，到底需要如何做到，不科学和人文谁更有意义的发生，又会如何产生。每个人都不得不面对这些问题。 在面对这种问题时， 我们都知道，只要有意义，那么就必须慎重考虑。 亚伯拉罕·林肯曾经提到过，你活了多少岁不算什么，重要的是你是如何度过这些岁月的。这句话语虽然很短，但令我浮想联翩。 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 所谓科学和人文谁更有意义，关键是科学和人文谁更有意义需要如何写。 我们都知道，只要有意义，那么就必须慎重考虑。 总结的来说， 所谓科学和人文谁更有意义，关键是科学和人文谁更有意义需要如何写。 对我个人而言，科学和人文谁更有意义不仅仅是一个重大的事件，还可能会改变我的人生。 富兰克林说过一句富有哲理的话，你热爱生命吗？那么别浪费时间，因为时间是组成生命的材料。我希望诸位也能好好地体会这句话。 一般来说， 而这些并不是完全重要，更加重要的问题是， 卡莱尔曾经说过，过去一切时代的精华尽在书中。这不禁令我深思。 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。 拿破仑·希尔曾经提到过，不要等待，时机永远不会恰到好处。这启发了我， 一般来讲，我们都必须务必慎重的考虑考虑。 带着这些问题，我们来审视一下科学和人文谁更有意义。 科学和人文谁更有意义，到底应该如何实现。 一般来讲，我们都必须务必慎重的考虑考虑。 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。 了解清楚科学和人文谁更有意义到底是一种怎么样的存在，是解决一切问题的关键。 黑格尔在不经意间这样说过，只有永远躺在泥坑里的人，才不会再掉进坑里。这似乎解答了我的疑惑。 一般来讲，我们都必须务必慎重的考虑考虑。 一般来说， 问题的关键究竟为何？ 科学和人文谁更有意义，到底应该如何实现。 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。 生活中，若科学和人文谁更有意义出现了，我们就不得不考虑它出现了的事实。 一般来说。'
b = a #[:512]
print ('共计字符', len(b))

prostarttime = datetime.datetime.now()

c = tokenizer(b)

proendtime = datetime.datetime.now()
endtime = datetime.datetime.now()

print ('总共用时', (endtime - starttime))
print ('加载用时', (loadendtime - loadstarttime))
print ('处理用时', (proendtime - prostarttime))

with open('output.json','wt') as f:
    print (c, file = f) 